templates/shipment-get.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthHeader xmlns="https://www.xend.com.ph/api/">
      <UserToken>{{ Settings::USER_TOKEN }}</UserToken>
    </AuthHeader>
  </soap:Header>
  <soap:Body>
    <Get xmlns="https://www.xend.com.ph/api/">
      <WaybillNo>{{ waybillno }}</WaybillNo>
    </Get>
  </soap:Body>
</soap:Envelope>